# 1. 列选择

1. 普通
2. `iloc属性`

In [5]:
import pandas as pd
df = pd.read_csv("/Users/stu/Desktop/Python Exercise/data/property-data.csv")
df.head()

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700
4          NaN   203.0   BERKELEY            Y            3        2  1600

In [9]:
df["PID"] # 一个series

0    100001000.0
1    100002000.0
2    100003000.0
3    100004000.0
4            NaN
5    100006000.0
6    100007000.0
7    100008000.0
8    100009000.0
Name: PID, dtype: float64

In [10]:
df["PDF","ST_NUM"]

KeyError: ('PDF', 'ST_NUM')

In [11]:
df[["PID",'ST_NUM']]

           PID  ST_NUM
0  100001000.0   104.0
1  100002000.0   197.0
2  100003000.0     NaN
3  100004000.0   201.0
4          NaN   203.0
5  100006000.0   207.0
6  100007000.0     NaN
7  100008000.0   213.0
8  100009000.0   215.0

In [20]:
# property DataFrame.iloc
# Purely integer-location based indexing for selection by position
df.iloc[:,1:2] # 切片索引 - 光标

   ST_NUM
0   104.0
1   197.0
2     NaN
3   201.0
4   203.0
5   207.0
6     NaN
7   213.0
8   215.0

# 2. 行选择

In [23]:
df.loc[[0,3]]

           PID  ST_NUM   ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0    PUTNAM            Y            3        1  1000
3  100004000.0   201.0  BERKELEY           12            1      NaN   700

In [24]:
df.loc[0:3]

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3        1  1000
1  100002000.0   197.0  LEXINGTON            N            3      1.5    --
2  100003000.0     NaN  LEXINGTON            N          NaN        1   850
3  100004000.0   201.0   BERKELEY           12            1      NaN   700

# 3. 筛选 - 布尔索引

In [44]:
missing_values = ["n/a","na",'--']
df = pd.read_csv("/Users/stu/Desktop/Python Exercise/data/property-data.csv", na_values = missing_values)

df["NUM_BEDROOMS"] = df["NUM_BEDROOMS"].fillna(0)

df[df["NUM_BEDROOMS"] == 0]

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
2  100003000.0     NaN  LEXINGTON            N           0.0        1   850.0
5  100006000.0   207.0   BERKELEY            Y           0.0        1   800.0
8  100009000.0   215.0    TREMONT            Y           0.0        2  1800.0

In [46]:
df["NUM_BEDROOMS"] == 0 # 可以所谓筛选条件

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
8     True
Name: NUM_BEDROOMS, dtype: bool

In [54]:
(df["NUM_BEDROOMS"] == 0) and (df["OWN_OCCUPIED"] == "N") # 可以所谓筛选条件

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [58]:
# and 和 or 只能单值比较
(df["NUM_BEDROOMS"] == 0).all() and (df["OWN_OCCUPIED"] == "N").any() # 可以所谓筛选条件

False

In [59]:
(df["NUM_BEDROOMS"] == 0).all()

False

In [61]:
(df["NUM_BEDROOMS"] == 0) & (df["OWN_OCCUPIED"] == "N") # 可以所谓筛选条件

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [62]:
df[(df["NUM_BEDROOMS"] == 0) & (df["OWN_OCCUPIED"] == "N")]

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH  SQ_FT
2  100003000.0     NaN  LEXINGTON            N           0.0        1  850.0

# 4. 行列同时选择

In [63]:
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           0.0        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           0.0        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           0.0        2  1800.0

In [81]:
df.loc[0:3,["PID","ST_NUM"]] # 行名 + 列名

           PID  ST_NUM
0  100001000.0   104.0
1  100002000.0   197.0
2  100003000.0     NaN
3  100004000.0   201.0

In [85]:
#df.ix[0:3,["PID","ST_NUM"]]

In [67]:
df.iloc[0:3,[1,2]] # 行号 + 列号

   ST_NUM    ST_NAME
0   104.0     PUTNAM
1   197.0  LEXINGTON
2     NaN  LEXINGTON

In [69]:
## 布尔索引很合

df[df["NUM_BEDROOMS"] == 0] # 当作是一个新表

#df[df["NUM_BEDROOMS"] == 0][[0,1],["PID",'ST_NUM']]

           PID  ST_NUM    ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
2  100003000.0     NaN  LEXINGTON            N           0.0        1   850.0
5  100006000.0   207.0   BERKELEY            Y           0.0        1   800.0
8  100009000.0   215.0    TREMONT            Y           0.0        2  1800.0

In [73]:
df[df["NUM_BEDROOMS"] == 0][["PID",'ST_NUM']]

           PID  ST_NUM
2  100003000.0     NaN
5  100006000.0   207.0
8  100009000.0   215.0

InvalidIndexError: ('2', [])